tutorials/incompressible/pimpleSolver/laminar/ACCM_triangularCavity/0/U
/*-------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
	version				2.0;
	format				ascii;
	class				volVectorField;
	location			"0";
	object				U;
}

//--------------------------------------------------------------------------------

dimensions				[0 1 -1 0 0 0 0];

internalField				uniform (0 0 0);

boundaryField
{
	fixed-walls
	{
		type            	fixedValue;
        value				uniform (0 0 0);
	}
	moving-wall
	{
		type            	fixedValue;
        value				uniform (2 0 0);
	}
    symm
	{
		type			empty;
	}
}
