tutorials/incompressible/pimpleSolver/laminar/ACCM_triangularCavity/0/p
/*-------------------------------------------------------------------------------*
Caelus 8.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
	version				2.0;
	format				ascii;
	class				volScalarField;
	object				p;
}

//--------------------------------------------------------------------------------

dimensions				[0 2 -2 0 0 0 0];

internalField				uniform 0;

boundaryField
{
	fixed-walls
	{
		type			zeroGradient;
	}
	moving-wall
	{
		type			zeroGradient;
	}
    symm
	{
		type			empty;
	}
}
