tutorials/incompressible/pimpleSolver/laminar/ACCM_triangularCavity/constant/polyMesh/boundary
/*-------------------------------------------------------------------------------*
Caelus V4.10
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

3         
(
    fixed-walls
    {
        type wall;
        nFaces 276;
        startFace 8910;
    }
    moving-wall
    {
        type wall;
        nFaces 39;
        startFace 9186;
    }
    symm
    {
        type empty;
        nFaces 11076;
        startFace 9225;
    }
)
