tutorials/incompressible/pimpleSolver/laminar/ACCM_triangularCavity/system/sampleDict
/*-------------------------------------------------------------------------------*
Caelus 4.10
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
    version     			2.0;
    format      			ascii;
    class       			dictionary;
    location    			"system";
    object      			sampleSurfaceDict;
}

//--------------------------------------------------------------------------------

interpolationScheme			cellPoint;

setFormat					raw;

sets

(

	cavity
	{	
		type				uniform;
		axis				y;
		start				(0 -4.0 0);
		end					(0 0.0 0);
		nPoints				100;
	}
);

fields						(
							U
							);
		
